coded_texts = {
    "text1": "фёасг ш ерлвёгьвё чсйёвёд вёйсцершёд люйнпвр л окйлвёмё згрцк с сдрг зё ёоыцкю гюарб лшёрмё жшкеся вйпзеыб еёл с мпоы фкйквнрйк ёе оыг оёгьчр дёгцкгсшёмё црд йкжмёшёйцсшёмё; сдрг акур огкмёйёаеёр зёопуареср в зйёлшрщресю нё рлнь цнресю весм лёарйукесрд вёнёйыф ер жкнйпаеягля рдп оыгё лёшрйчрееё шлр йкшеё зёфёуареср гс шгюогрееёмё мрйёя зйёлнё опвшкйь сгс дёгсншреесв  ёе шлр цснкг л йкшеыд шесдкесрд рлгс оы рдп зёашрйепгс фсдсю ёе с ён ерр оы ер ёнвкжкгля рдп ейкшсгёль ер нё ё црд цснкг ёе её оёгьчр лкдёр цнреср сгс гпцчр лвкжкнь зйёхрлл лкдёмё цнреся цнё шёнар сж опвш шрцеё шыфёасн вквёресопаь лгёшё вёнёйёр сеёб йкж црйн жекрн цнё с жекцсн энё цнреср лёшрйчкгёль оёгрр ш грукцрд зёгёуресс ш зрйраерб ек вйёшкнс с ек нютявр ларгкшчрдля ён нквёмё ёолнёянргьлншк посныд с нёереьвсд вкв грзрчвк вйёдр лнйклнс в цнресю ёе сдрг рщр ашк ёоывеёшреся лёлнкшгяшчср ашр айпмср рмё фкйквнрйсцрлвср црйны лзкнь ер йкжаршкяль нкв вкв рлнь ш нёд ур люйнпвр с еёлснь шлрмак л лёоёю вквёбнё лшёб ёлёорееыб шёжапф лшёрмё лёолншрееёмё жкзкфк ёнжышкшчсбля ерлвёгьвё усгыд зёвёрд нкв цнё аёлнкнёцеё оыгё рдп нёгьвё зйслнйёснь мар есопаь лшёю вйёшкнь фёнь акур ш ерёоснкрдёб аёнёгр вёдекнр ак зрйрнкщснь нпак чсергь с зёуснвс с пур вкжкгёль цнё ш энёб вёдекнр грн арлянь усгс гюас цсцсвёш опапцс цргёшрв шрльдк щрвёнгсшыб с акур ш ервёнёйыф лгпцкяф зйсшрйрагсшыб зёняепшчс в лрор шёжапф ек лшрусб еёл зёпнйп нёгьвё зёдкйщсшкгля ак шлнйяфсшкг мёгёшёю зйсмёшкйсшкя ны ойкн црйн нроя жекрн зёнррчь цнё гс лфёасг оы ны фёнь ш окею ек цнё зрнйпчвк есцрмё ер ёншрцкг с лнкйкгля нпн ур жкеяньля вквсд есопаь аргёд ",
    "text2": "швшлдррш еаыхдгрк лцьк ю ъгшх ьымд дчш хдагюкя льдиршвгщ еаыикюкюскя ювдб зынышршхыы хшьшишчш пдьшюдтк ынхшжидррцб юыи рдвхшгая рк ишюшьщрш тадетшд вьшждрыд ы юхдвгд в гдх пгш гш вгаквгршд иш вгакикрыя рд чкахшрыашюкюсдд в ркйкьщршэ ы чаёлшэ ёьцлтшб ы в аднтых вкхшишюшьщрцх дчш юнчьяишх шр лць гдеьш шидг ю сыаштыб хдаьёсдпыб пдарцб тацгцб гёьёе ы нк ршпщ рд нял гшчик ткт вшвди дчш еаырёжидр лць юцрдвгы рк вюшдб ыниашчсдб веырд ювэ вькишвгщ вцашб ршялащвтшб аёввтшб ршпы т тшгшашб шпдюыирш лць рд еаычшгшюьдр рк рдх лць ишюшьщрш сыаштыб ы гшьвгцб еьку лдн аёткюшю ы в шчашхрцх ткеэсшршх гшпщ ю гшпщ ткт ёешгадльяэг пквгш ишашжрцд еш ныхкх чид рылёищ икьдтш нк чакрымдб ю сюдбмкаыы ыьы ркеаыхда ю вдюдаршб ыгкьыы рд акввпыгцюкя тшрдпрш еаы ъгшх ы рк гктыд тшрмц еш ишашчд ткт шг ъбигтёрдрк иш едгдалёачк рш пгш чшиыьшвщ ы юешьрд ёишюьдгюшаяьш ю ыгкьыы гш шткнкьшвщ рд вшювдх еаычширцх ю ашввыы шлькикгдьщ еькук в ткеэсшршх лць хшьшишб пдьшюдт гшжд ьдг июкимкгы сдвгы ыьы июкимкгы вдхы ашвгк рдхршчш ешюцсд вадирдчш шпдрщ лдьштёа чёвгшюшьшв вш юекьцхы удткхы ы в ьдчшрщтшэ юшвгадрщтшэ ешпгы вшюдасдррш лдьшэ лшашитшб чькнк дчш лцьы лшьщсыд чшьёлцд ы еаывгкьщрцд; юш юнчьяид ый лцьш пгшгш гыйшд рш гяждьшд пгшгш ешьршд гшчш вгакрршчш юцакждрыя еш тшгшашхё рдтшгшацд ёчкицюкэг в едаюшчш юнчьяик ю вёлфдтгд екиёпёэ лшьднрщ ьымш хшьшишчш пдьшюдтк лцьш юеашпдх еаыягршд гшртшд ы вёйшд рш лдвмюдгршд к гдедащ икжд ишвыря ыннялсдд ю аёткй дчш лшьгкьвя гшуыб ёндьшт ын вгкашчш ешьыряьшчш зёьяак нктьэпкюсыб ткждгвя ювд дчш ишашжршд ишвгшярыд рк ршчкй дчш лцьы гшьвгшешишсюдррцд лксхкты в сгыльдгкхы  ювд рд ешаёввты пдаршюшьшвцб вшвди ю тацгшх гёьёед ювд ъгш акнчьяидь пквгыэ шг рдпдчш идькгщ ы рктшрдм веашвыь в гшэ рдидьыткгршэ ёвхдстшб ю тшгшашб гкт лдвмдадхшррш ы рдладжрш юцакжкдгвя ыршчик ьэивтшд ёишюшьщвгюыд еаы рдёикпкй льыжрдчш",
}

none_coded = {
    "text1": """
        Марина Цветаева
        "Повесть о Сонечке "монолог

        - Ах, Марина! Как я люблю - любить! Как я безумно люблю - сама любить! С утра, нет, до утра,
        в то самое до-утро - еще спать и уже знать, что опять.. . Вы когда-нибудь забываете, когда
        любите - что любите? Я - никогда. Это как зубная боль - только наоборот, наоборотная зубная
        боль, только там ноет, а здесь - и слова нет. (Подумав: поёт? ) Ну, как сахар обратное соли,
        но той же силы. Ах, Марина! Марина! Марина! Какие они дикие дураки. (Я, все же изумленная: -
        Кто? ) - Да те, кто не любят, сами не любят, точно в том дело, чтобы тебя любили. Я не
        говорю.. . конечно.. . -устаешь - как в стену. Но Вы знаете, Марина (таинственно) , нет такой
        стены, которую бы я не пробила! Ведь и Юрочка.. . минуточками.. . у него почти любящие глаза!
        Но у него - у меня такое чувство - нет сил сказать это, ему легче гору поднять, чем сказать
        это слово. Потому что ему нечем его поддержать, а у меня за горою - еще гора, и еще гора, и
        еще гора.. . -целые Гималаи любви, Марина! Вы замечаете, Марина, как все они, даже самые
        целующие, даже самые как будто любящие, боятся сказать это слово, как они его никогда не
        говорят? ! Мне один объяснял, что это.. . грубо.. . (фыркает).. . отстало, что: зачем слова,
        когда - дела? (то есть поцелуи и так далее) . А я ему - ?Э-э! нет! Дело еще ничего не
        доказывает, а слово - всё?. Мне ведь только этого от человека нужно: люблю, и больше ничего,
        пусть потом что угодно делают, как угодно не любят, я делам не поверю, потому что слово -
        было. Я только этим словом кормилась, Марина, потому так и отощала.

        О, какие они скупые, расчетливые, опасливые, Марина! Мне всегда хочется сказать: - Ты только
        - скажи. Я проверять - не буду. Но не говорят, потому что думают, что это - жениться,
        связаться, не развязаться. Если я первым скажу, то никогда уже первым не смогу уйти. (Они и
        вторым не говорят, Марина, никоторым. ) Точно со мной можно не-первому уйти!

        Марина! Я - в жизни! - не уходила первая. И в жизни - сколько мне ее еще Бог отпустит -
        первая не уйду. Я просто не могу. Я всегда жду, чтобы другой ушел, все делаю, чтобы другой
        ушел, потому что мне первой уйти - легче перейти через собственный труп. (Какое страшное
        слово. Совсем мертвое. Ах, поняла: это тот мертвый, которого никто никогда не любил. Но для
        меня и такого мертвого нет, Марина! ) Я и внутри себя никогда не уходила первая. Никогда
        первая не переставала любить. Всегда - до последней возможности, до самой последней капельки
        - как когда в детстве пьешь. И уж жарко от пустого стакана - а все еще тянешь, и только собственный пар!
        Ах, знаете, вы будете смеяться - это была совсем короткая встреча - в одном турне - неважно,
        кто - совсем молодой - и я безумно в него влюбилась, потому что он все вечера садился в
        первый ряд - и бедно одетый, Марина! не по деньгам садился, а по глазам, и на третий вечер
        так на меня смотрел, что - либо глаза выскочат, либо сам - вскочит на сцену. (Говорю,
        двигаюсь, а сама все кошусь: ну, как? нет, еще сидит. ) Только это нужно понять! Потому что
        это не был обычный влюбленный мужской едящий взгляд (он был почти мальчик) - это был пьющий
        взгляд, Марина, он глядел как завороженный, точно я его каждым словом и движением - как на
        нитке - как на канате - притягиваю, наматываю - это чувство должны знать русалки - и еще
        скрипачи, верней смычки - и реки.. . И пожары, Марина!. . Что вот-вот вскочит в меня - как в
        костер. Я просто не знаю, как доиграла. Потому что у меня, Марина, все время было чувство,
        что в него, в эти глаза - оступлюсь.
    """
}
